/*
When        Who        Remarks
--------------------------------------
2011-SEP-25 Changhao   Initial version
*/


#ifndef __DS18B20_H__
#define __DS18B20_H__

#include <reg52.h>     //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义

/*------------------------------------------------
                    端口定义
------------------------------------------------*/
sbit DS18B20 = P2^6;//ds18b20 端口

/*------------------------------------------------
                  函数声明
------------------------------------------------*/
/*--------------
18b20初始化
返回1则初始化成功
返回0则初始化失败
----------------*/
bit initDS18B20(void);

// 读取温度
// 有两种模式：0和1
// 模式0：调用readTemperature(0)实际取得的是上次读取时的测得温度值
// 模式1：调用readTemperature(1)将取得当前的温度值，但是需要约800+ms后函数才返回。
// 返回是个浮点数（温度值） 
float getTemperature( bit mode );

#endif
